app/controllers/translations_controller.rb

  def index
    @translations = Translation.order('created_at DESC')
---
SELECT "translations".* FROM "translations" ORDER BY created_at DESC

  def destroy
    @translation.destroy
---
DELETE FROM "translations" WHERE "translations"."id" = $1  [["id", 1]]

    def set_translation
      @translation = Translation.find(params[:id])
---
SELECT  "translations".* FROM "translations" WHERE "translations"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]