app/controllers/translations_controller.rb

INSERT INTO "translations" ("native", "created_at", "times_correct", "times_incorrect", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["native", "asdas"], ["created_at", 2016-11-30 04:12:12 UTC], ["times_correct", 0], ["times_incorrect", 0], ["updated_at", 2016-11-30 04:12:12 UTC]]
---
  def create
    native_word = params[:native]
    target_word = params[:target]

    @translation = Translation.new({native: native_word, target: target_word})

    if @translation.save